Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Saheeh International.tmx
Source language: ar
Languages: en

source: هل أتى على الإنسان حين من الدهر لم يكن شيئا مذكورا
en: Has there [not] come upon man a period of time when he was not a thing [even] mentioned?

source: إنا خلقنا الإنسان من نطفة أمشاج نبتليه فجعلناه سميعا بصيرا
en: Indeed, We created man from a sperm-drop mixture that We may try him; and We made him hearing and seeing.

source: إنا هديناه السبيل إما شاكرا وإما كفورا
en: Indeed, We guided him to the way, be he grateful or be he ungrateful.

source: إنا أعتدنا للكافرين سلاسل وأغلالا وسعيرا
en: Indeed, We have prepared for the disbelievers chains and shackles and a blaze.

source: إن الأبرار يشربون من كأس كان مزاجها كافورا
en: Indeed, the righteous will drink from a cup [of wine] whose mixture is of Kafur,

source: عينا يشرب بها عباد الله يفجرونها تفجيرا
en: A spring of which the [righteous] servants of Allah will drink; they will make it gush forth in force [and abundance].

source: يوفون بالنذر ويخافون يوما كان شره مستطيرا
en: They [are those who] fulfill [their] vows and fear a Day whose evil will be widespread.

source: ويطعمون الطعام على حبه مسكينا ويتيما وأسيرا
en: And they give food in spite of love for it to the needy, the orphan, and the captive,

source: إنما نطعمكم لوجه الله لا نريد منكم جزاء ولا شكورا
en: [Saying], "We feed you only for the countenance of Allah. We wish not from you reward or gratitude.

source: إنا نخاف من ربنا يوما عبوسا قمطريرا
en: Indeed, We fear from our Lord a Day austere and distressful."

source: فوقاهم الله شر ذلك اليوم ولقاهم نضرة وسرورا
en: So Allah will protect them from the evil of that Day and give them radiance and happiness

source: وجزاهم بما صبروا جنة وحريرا
en: And will reward them for what they patiently endured [with] a garden [in Paradise] and silk [garments].

source: متكئين فيها على الأرائك لا يرون فيها شمسا ولا زمهريرا
en: [They will be] reclining therein on adorned couches. They will not see therein any [burning] sun or [freezing] cold.

source: ودانية عليهم ظلالها وذللت قطوفها تذليلا
en: And near above them are its shades, and its [fruit] to be picked will be lowered in compliance.

source: ويطاف عليهم بآنية من فضة وأكواب كانت قواريرا
en: And there will be circulated among them vessels of silver and cups having been [created] clear [as glass],

source: قوارير من فضة قدروها تقديرا
en: Clear glasses [made] from silver of which they have determined the measure.

source: ويسقون فيها كأسا كان مزاجها زنجبيلا
en: And they will be given to drink a cup [of wine] whose mixture is of ginger

source: عينا فيها تسمى سلسبيلا
en: [From] a fountain within Paradise named Salsabeel.

source: ويطوف عليهم ولدان مخلدون إذا رأيتهم حسبتهم لؤلؤا منثورا
en: There will circulate among them young boys made eternal. When you see them, you would think them [as beautiful as] scattered pearls.

source: وإذا رأيت ثم رأيت نعيما وملكا كبيرا
en: And when you look there [in Paradise], you will see pleasure and great dominion.

source: عاليهم ثياب سندس خضر وإستبرق وحلوا أساور من فضة وسقاهم ربهم شرابا طهورا
en: Upon the inhabitants will be green garments of fine silk and brocade. And they will be adorned with bracelets of silver, and their Lord will give them a purifying drink.

source: إن هذا كان لكم جزاء وكان سعيكم مشكورا
en: [And it will be said], "Indeed, this is for you a reward, and your effort has been appreciated."

source: إنا نحن نزلنا عليك القرآن تنزيلا
en: Indeed, it is We who have sent down to you, [O Muhammad], the Qur'an progressively.

source: فاصبر لحكم ربك ولا تطع منهم آثما أو كفورا
en: So be patient for the decision of your Lord and do not obey from among them a sinner or ungrateful [disbeliever].

source: واذكر اسم ربك بكرة وأصيلا
en: And mention the name of your Lord [in prayer] morning and evening

source: ومن الليل فاسجد له وسبحه ليلا طويلا
en: And during the night prostrate to Him and exalt Him a long [part of the] night.

source: إن هؤلاء يحبون العاجلة ويذرون وراءهم يوما ثقيلا
en: Indeed, these [disbelievers] love the immediate and leave behind them a grave Day.

source: نحن خلقناهم وشددنا أسرهم وإذا شئنا بدلنا أمثالهم تبديلا
en: We have created them and strengthened their forms, and when We will, We can change their likenesses with [complete] alteration.

source: وما تشاءون إلا أن يشاء الله إن الله كان عليما حكيما
en: And you do not will except that Allah wills. Indeed, Allah is ever Knowing and Wise.

source: يدخل من يشاء في رحمته والظالمين أعد لهم عذابا أليما
en: He admits whom He wills into His mercy; but the wrongdoers - He has prepared for them a painful punishment.

source: والمرسلات عرفا
en: By those [winds] sent forth in gusts

source: فالعاصفات عصفا
en: And the winds that blow violently

source: والناشرات نشرا
en: And [by] the winds that spread [clouds]

source: فالفارقات فرقا
en: And those [angels] who bring criterion

source: فالملقيات ذكرا
en: And those [angels] who deliver a message

source: عذرا أو نذرا
en: As justification or warning,

source: إنما توعدون لواقع
en: Indeed, what you are promised is to occur.

source: فإذا النجوم طمست
en: So when the stars are obliterated

source: وإذا السماء فرجت
en: And when the heaven is opened

source: وإذا الجبال نسفت
en: And when the mountains are blown away

source: وإذا الرسل أقتت
en: And when the messengers' time has come...

source: لأي يوم أجلت
en: For what Day was it postponed?

source: ليوم الفصل
en: For the Day of Judgement.

source: وما أدراك ما يوم الفصل
en: And what can make you know what is the Day of Judgement?

source: ويل يومئذ للمكذبين
en: Woe, that Day, to the deniers.

source: ألم نهلك الأولين
en: Did We not destroy the former peoples?

source: ثم نتبعهم الآخرين
en: Then We will follow them with the later ones.

source: كذلك نفعل بالمجرمين
en: Thus do We deal with the criminals.

source: ألم نخلقكم من ماء مهين
en: Did We not create you from a liquid disdained?

source: فجعلناه في قرار مكين
en: And We placed it in a firm lodging

source: إلى قدر معلوم
en: For a known extent.

source: فقدرنا فنعم القادرون
en: And We determined [it], and excellent [are We] to determine.

source: ألم نجعل الأرض كفاتا
en: Have We not made the earth a container

source: أحياء وأمواتا
en: Of the living and the dead?

source: وجعلنا فيها رواسي شامخات وأسقيناكم ماء فراتا
en: And We placed therein lofty, firmly set mountains and have given you to drink sweet water.

source: انطلقوا إلى ما كنتم به تكذبون
en: [They will be told], "Proceed to that which you used to deny.

source: انطلقوا إلى ظل ذي ثلاث شعب
en: Proceed to a shadow [of smoke] having three columns

source: لا ظليل ولا يغني من اللهب
en: [But having] no cool shade and availing not against the flame."

source: إنها ترمي بشرر كالقصر
en: Indeed, it throws sparks [as huge] as a fortress,

source: كأنه جمالت صفر
en: As if they were yellowish [black] camels.

source: هذا يوم لا ينطقون
en: This is a Day they will not speak,

source: ولا يؤذن لهم فيعتذرون
en: Nor will it be permitted for them to make an excuse.

source: هذا يوم الفصل جمعناكم والأولين
en: This is the Day of Judgement; We will have assembled you and the former peoples.

source: فإن كان لكم كيد فكيدون
en: So if you have a plan, then plan against Me.

source: إن المتقين في ظلال وعيون
en: Indeed, the righteous will be among shades and springs

source: وفواكه مما يشتهون
en: And fruits from whatever they desire,

source: كلوا وتمتعوا قليلا إنكم مجرمون
en: [O disbelievers], eat and enjoy yourselves a little; indeed, you are criminals.

source: وإذا قيل لهم اركعوا لا يركعون
en: And when it is said to them, "Bow [in prayer]," they do not bow.

source: فبأي حديث بعده يؤمنون
en: Then in what statement after the Qur'an will they believe?

source: عم يتساءلون
en: About what are they asking one another?

source: عن النبإ العظيم
en: About the great news -

source: الذي هم فيه مختلفون
en: That over which they are in disagreement.

source: كلا سيعلمون
en: No! They are going to know.

source: ثم كلا سيعلمون
en: Then, no! They are going to know.

source: ألم نجعل الأرض مهادا
en: Have We not made the earth a resting place?

source: والجبال أوتادا
en: And the mountains as stakes?

source: وخلقناكم أزواجا
en: And We created you in pairs

source: وجعلنا نومكم سباتا
en: And made your sleep [a means for] rest

source: وجعلنا الليل لباسا
en: And made the night as clothing

source: وجعلنا النهار معاشا
en: And made the day for livelihood

source: وبنينا فوقكم سبعا شدادا
en: And constructed above you seven strong [heavens]

source: وجعلنا سراجا وهاجا
en: And made [therein] a burning lamp

source: وأنزلنا من المعصرات ماء ثجاجا
en: And sent down, from the rain clouds, pouring water

source: لنخرج به حبا ونباتا
en: That We may bring forth thereby grain and vegetation

source: وجنات ألفافا
en: And gardens of entwined growth.

source: إن يوم الفصل كان ميقاتا
en: Indeed, the Day of Judgement is an appointed time -

source: يوم ينفخ في الصور فتأتون أفواجا
en: The Day the Horn is blown and you will come forth in multitudes

source: وفتحت السماء فكانت أبوابا
en: And the heaven is opened and will become gateways

source: وسيرت الجبال فكانت سرابا
en: And the mountains are removed and will be [but] a mirage.

source: إن جهنم كانت مرصادا
en: Indeed, Hell has been lying in wait

source: للطاغين مآبا
en: For the transgressors, a place of return,

source: لابثين فيها أحقابا
en: In which they will remain for ages [unending].

source: لا يذوقون فيها بردا ولا شرابا
en: They will not taste therein [any] coolness or drink

source: إلا حميما وغساقا
en: Except scalding water and [foul] purulence -

source: جزاء وفاقا
en: An appropriate recompense.

source: إنهم كانوا لا يرجون حسابا
en: Indeed, they were not expecting an account

source: وكذبوا بآياتنا كذابا
en: And denied Our verses with [emphatic] denial.

source: وكل شيء أحصيناه كتابا
en: But all things We have enumerated in writing.

source: فذوقوا فلن نزيدكم إلا عذابا
en: "So taste [the penalty], and never will We increase you except in torment."

source: إن للمتقين مفازا
en: Indeed, for the righteous is attainment -

source: حدائق وأعنابا
en: Gardens and grapevines

source: وكواعب أترابا
en: And full-breasted [companions] of equal age

source: وكأسا دهاقا
en: And a full cup.

source: لا يسمعون فيها لغوا ولا كذابا
en: No ill speech will they hear therein or any falsehood -

source: جزاء من ربك عطاء حسابا
en: [As] reward from your Lord, [a generous] gift [made due by] account,

source: رب السماوات والأرض وما بينهما الرحمن لا يملكون منه خطابا
en: [From] the Lord of the heavens and the earth and whatever is between them, the Most Merciful. They possess not from Him [authority for] speech.

source: يوم يقوم الروح والملائكة صفا لا يتكلمون إلا من أذن له الرحمن وقال صوابا
en: The Day that the Spirit and the angels will stand in rows, they will not speak except for one whom the Most Merciful permits, and he will say what is correct.

source: ذلك اليوم الحق فمن شاء اتخذ إلى ربه مآبا
en: That is the True Day; so he who wills may take to his Lord a [way of] return.

source: إنا أنذرناكم عذابا قريبا يوم ينظر المرء ما قدمت يداه ويقول الكافر يا ليتني كنت ترابا
en: Indeed, We have warned you of a near punishment on the Day when a man will observe what his hands have put forth and the disbeliever will say, "Oh, I wish that I were dust!"

source: والنازعات غرقا
en: By those [angels] who extract with violence

source: والناشطات نشطا
en: And [by] those who remove with ease

source: والسابحات سبحا
en: And [by] those who glide [as if] swimming

source: فالسابقات سبقا
en: And those who race each other in a race

source: فالمدبرات أمرا
en: And those who arrange [each] matter,

source: يوم ترجف الراجفة
en: On the Day the blast [of the Horn] will convulse [creation],

source: تتبعها الرادفة
en: There will follow it the subsequent [one].

source: قلوب يومئذ واجفة
en: Hearts, that Day, will tremble,

source: أبصارها خاشعة
en: Their eyes humbled.

source: يقولون أإنا لمردودون في الحافرة
en: They are [presently] saying, "Will we indeed be returned to [our] former state [of life]?

source: أإذا كنا عظاما نخرة
en: Even if we should be decayed bones?

source: قالوا تلك إذا كرة خاسرة
en: They say, "That, then, would be a losing return."

source: فإنما هي زجرة واحدة
en: Indeed, it will be but one shout,

source: فإذا هم بالساهرة
en: And suddenly they will be [alert] upon the earth's surface.

source: هل أتاك حديث موسى
en: Has there reached you the story of Moses? -

source: إذ ناداه ربه بالواد المقدس طوى
en: When his Lord called to him in the sacred valley of Tuwa,

source: فقل هل لك إلى أن تزكى
en: And say to him, 'Would you [be willing to] purify yourself

source: وأهديك إلى ربك فتخشى
en: And let me guide you to your Lord so you would fear [Him]?'"

source: فأراه الآية الكبرى
en: And he showed him the greatest sign,

source: فكذب وعصى
en: But Pharaoh denied and disobeyed.

source: ثم أدبر يسعى
en: Then he turned his back, striving.

source: فحشر فنادى
en: And he gathered [his people] and called out

source: فقال أنا ربكم الأعلى
en: And said, "I am your most exalted lord."

source: فأخذه الله نكال الآخرة والأولى
en: So Allah seized him in exemplary punishment for the last and the first [transgression].

source: إن في ذلك لعبرة لمن يخشى
en: Indeed in that is a warning for whoever would fear [Allah].

source: أأنتم أشد خلقا أم السماء بناها
en: Are you a more difficult creation or is the heaven? Allah constructed it.

source: رفع سمكها فسواها
en: He raised its ceiling and proportioned it.

source: وأغطش ليلها وأخرج ضحاها
en: And He darkened its night and extracted its brightness.

source: والأرض بعد ذلك دحاها
en: And after that He spread the earth.

source: أخرج منها ماءها ومرعاها
en: He extracted from it its water and its pasture,

source: والجبال أرساها
en: And the mountains He set firmly

source: متاعا لكم ولأنعامكم
en: As provision for you and your grazing livestock.

source: فإذا جاءت الطامة الكبرى
en: But when there comes the greatest Overwhelming Calamity -

source: يوم يتذكر الإنسان ما سعى
en: The Day when man will remember that for which he strove,

source: وبرزت الجحيم لمن يرى
en: And Hellfire will be exposed for [all] those who see -

source: فأما من طغى
en: So as for he who transgressed

source: وآثر الحياة الدنيا
en: And preferred the life of the world,

source: فإن الجحيم هي المأوى
en: Then indeed, Hellfire will be [his] refuge.

source: وأما من خاف مقام ربه ونهى النفس عن الهوى
en: But as for he who feared the position of his Lord and prevented the soul from [unlawful] inclination,

source: فإن الجنة هي المأوى
en: Then indeed, Paradise will be [his] refuge.

source: يسألونك عن الساعة أيان مرساها
en: They ask you, [O Muhammad], about the Hour: when is its arrival?

source: فيم أنت من ذكراها
en: In what [position] are you that you should mention it?

source: إلى ربك منتهاها
en: To your Lord is its finality.

source: إنما أنت منذر من يخشاها
en: You are only a warner for those who fear it.

source: كأنهم يوم يرونها لم يلبثوا إلا عشية أو ضحاها
en: It will be, on the Day they see it, as though they had not remained [in the world] except for an afternoon or a morning thereof.

source: عبس وتولى
en: The Prophet frowned and turned away

source: أن جاءه الأعمى
en: Because there came to him the blind man, [interrupting].

source: وما يدريك لعله يزكى
en: But what would make you perceive, [O Muhammad], that perhaps he might be purified

source: أو يذكر فتنفعه الذكرى
en: Or be reminded and the remembrance would benefit him?

source: أما من استغنى
en: As for he who thinks himself without need,

source: فأنت له تصدى
en: To him you give attention.

source: وما عليك ألا يزكى
en: And not upon you [is any blame] if he will not be purified.

source: وأما من جاءك يسعى
en: But as for he who came to you striving [for knowledge]

source: وهو يخشى
en: While he fears [Allah],

source: فأنت عنه تلهى
en: From him you are distracted.

source: كلا إنها تذكرة
en: No! Indeed, these verses are a reminder;

source: في صحف مكرمة
en: [It is recorded] in honored sheets,

source: مرفوعة مطهرة
en: Exalted and purified,

source: بأيدي سفرة
en: [Carried] by the hands of messenger-angels,

source: كرام بررة
en: Noble and dutiful.

source: قتل الإنسان ما أكفره
en: Cursed is man; how disbelieving is he.

source: من أي شيء خلقه
en: From what substance did He create him?

source: من نطفة خلقه فقدره
en: From a sperm-drop He created him and destined for him;

source: ثم السبيل يسره
en: Then He eased the way for him;

source: ثم أماته فأقبره
en: Then He causes his death and provides a grave for him.

source: ثم إذا شاء أنشره
en: Then when He wills, He will resurrect him.

source: كلا لما يقض ما أمره
en: No! Man has not yet accomplished what He commanded him.

source: فلينظر الإنسان إلى طعامه
en: Then let mankind look at his food -

source: أنا صببنا الماء صبا
en: How We poured down water in torrents,

source: ثم شققنا الأرض شقا
en: Then We broke open the earth, splitting [it with sprouts],

source: فأنبتنا فيها حبا
en: And caused to grow within it grain

source: وعنبا وقضبا
en: And grapes and herbage

source: وزيتونا ونخلا
en: And olive and palm trees

source: وحدائق غلبا
en: And gardens of dense shrubbery

source: وفاكهة وأبا
en: And fruit and grass -

source: فإذا جاءت الصاخة
en: But when there comes the Deafening Blast

source: يوم يفر المرء من أخيه
en: On the Day a man will flee from his brother

source: وأمه وأبيه
en: And his mother and his father

source: وصاحبته وبنيه
en: And his wife and his children,

source: لكل امرئ منهم يومئذ شأن يغنيه
en: For every man, that Day, will be a matter adequate for him.

source: وجوه يومئذ مسفرة
en: [Some] faces, that Day, will be bright -

source: ضاحكة مستبشرة
en: Laughing, rejoicing at good news.

source: ووجوه يومئذ عليها غبرة
en: And [other] faces, that Day, will have upon them dust.

source: ترهقها قترة
en: Blackness will cover them.

source: أولئك هم الكفرة الفجرة
en: Those are the disbelievers, the wicked ones.

source: إذا الشمس كورت
en: When the sun is wrapped up [in darkness]

source: وإذا النجوم انكدرت
en: And when the stars fall, dispersing,

source: وإذا الجبال سيرت
en: And when the mountains are removed

source: وإذا العشار عطلت
en: And when full-term she-camels are neglected

source: وإذا الوحوش حشرت
en: And when the wild beasts are gathered

source: وإذا البحار سجرت
en: And when the seas are filled with flame

source: وإذا النفوس زوجت
en: And when the souls are paired

source: وإذا الموءودة سئلت
en: And when the girl [who was] buried alive is asked

source: بأي ذنب قتلت
en: For what sin she was killed

source: وإذا الصحف نشرت
en: And when the pages are made public

source: وإذا السماء كشطت
en: And when the sky is stripped away

source: وإذا الجحيم سعرت
en: And when Hellfire is set ablaze

source: وإذا الجنة أزلفت
en: And when Paradise is brought near,

source: علمت نفس ما أحضرت
en: A soul will [then] know what it has brought [with it].

source: فلا أقسم بالخنس
en: So I swear by the retreating stars -

source: الجوار الكنس
en: Those that run [their courses] and disappear -

source: والليل إذا عسعس
en: And by the night as it closes in

source: والصبح إذا تنفس
en: And by the dawn when it breathes

source: ذي قوة عند ذي العرش مكين
en: [Who is] possessed of power and with the Owner of the Throne, secure [in position],

source: مطاع ثم أمين
en: Obeyed there [in the heavens] and trustworthy.

source: وما صاحبكم بمجنون
en: And your companion is not [at all] mad.

source: ولقد رآه بالأفق المبين
en: And he has already seen Gabriel in the clear horizon.

source: وما هو على الغيب بضنين
en: And Muhammad is not a withholder of [knowledge of] the unseen.

source: وما هو بقول شيطان رجيم
en: And the Qur'an is not the word of a devil, expelled [from the heavens].

source: فأين تذهبون
en: So where are you going?

source: لمن شاء منكم أن يستقيم
en: For whoever wills among you to take a right course.

source: وما تشاءون إلا أن يشاء الله رب العالمين
en: And you do not will except that Allah wills - Lord of the worlds.

source: إذا السماء انفطرت
en: When the sky breaks apart

source: وإذا الكواكب انتثرت
en: And when the stars fall, scattering,

source: وإذا البحار فجرت
en: And when the seas are erupted

source: وإذا القبور بعثرت
en: And when the [contents of] graves are scattered,

source: علمت نفس ما قدمت وأخرت
en: A soul will [then] know what it has put forth and kept back.

source: يا أيها الإنسان ما غرك بربك الكريم
en: O mankind, what has deceived you concerning your Lord, the Generous,

source: الذي خلقك فسواك فعدلك
en: Who created you, proportioned you, and balanced you?

source: في أي صورة ما شاء ركبك
en: In whatever form He willed has He assembled you.

source: كلا بل تكذبون بالدين
en: No! But you deny the Recompense.

source: وإن عليكم لحافظين
en: And indeed, [appointed] over you are keepers,

source: كراما كاتبين
en: Noble and recording;

source: يعلمون ما تفعلون
en: They know whatever you do.

source: إن الأبرار لفي نعيم
en: Indeed, the righteous will be in pleasure,

source: وإن الفجار لفي جحيم
en: And indeed, the wicked will be in Hellfire.

source: يصلونها يوم الدين
en: They will [enter to] burn therein on the Day of Recompense,

source: وما هم عنها بغائبين
en: And never therefrom will they be absent.

source: وما أدراك ما يوم الدين
en: And what can make you know what is the Day of Recompense?

source: ثم ما أدراك ما يوم الدين
en: Then, what can make you know what is the Day of Recompense?

source: يوم لا تملك نفس لنفس شيئا والأمر يومئذ لله
en: It is the Day when a soul will not possess for another soul [power to do] a thing; and the command, that Day, is [entirely] with Allah .

source: ويل للمطففين
en: Woe to those who give less [than due],

source: الذين إذا اكتالوا على الناس يستوفون
en: Who, when they take a measure from people, take in full.

source: وإذا كالوهم أو وزنوهم يخسرون
en: But if they give by measure or by weight to them, they cause loss.

source: ألا يظن أولئك أنهم مبعوثون
en: Do they not think that they will be resurrected

source: ليوم عظيم
en: For a tremendous Day -

source: يوم يقوم الناس لرب العالمين
en: The Day when mankind will stand before the Lord of the worlds?

source: كلا إن كتاب الفجار لفي سجين
en: No! Indeed, the record of the wicked is in sijjeen.

source: وما أدراك ما سجين
en: And what can make you know what is sijjeen?

source: كتاب مرقوم
en: It is [their destination recorded in] a register inscribed.

source: الذين يكذبون بيوم الدين
en: Who deny the Day of Recompense.

source: وما يكذب به إلا كل معتد أثيم
en: And none deny it except every sinful transgressor.

source: كلا بل ران على قلوبهم ما كانوا يكسبون
en: No! Rather, the stain has covered their hearts of that which they were earning.

source: كلا إنهم عن ربهم يومئذ لمحجوبون
en: No! Indeed, from their Lord, that Day, they will be partitioned.

source: ثم إنهم لصالو الجحيم
en: Then indeed, they will [enter and] burn in Hellfire.

source: ثم يقال هذا الذي كنتم به تكذبون
en: Then it will be said [to them], "This is what you used to deny."

source: كلا إن كتاب الأبرار لفي عليين
en: No! Indeed, the record of the righteous is in 'illiyyun.

source: وما أدراك ما عليون
en: And what can make you know what is 'illiyyun?

source: يشهده المقربون
en: Which is witnessed by those brought near [to Allah].

source: على الأرائك ينظرون
en: On adorned couches, observing.

source: تعرف في وجوههم نضرة النعيم
en: You will recognize in their faces the radiance of pleasure.

source: يسقون من رحيق مختوم
en: They will be given to drink [pure] wine [which was] sealed.

source: ختامه مسك وفي ذلك فليتنافس المتنافسون
en: The last of it is musk. So for this let the competitors compete.

source: ومزاجه من تسنيم
en: And its mixture is of Tasneem,

source: عينا يشرب بها المقربون
en: A spring from which those near [to Allah] drink.

source: إن الذين أجرموا كانوا من الذين آمنوا يضحكون
en: Indeed, those who committed crimes used to laugh at those who believed.

source: وإذا مروا بهم يتغامزون
en: And when they passed by them, they would exchange derisive glances.
